app/Controllers/History.php

SELECT *
FROM `history`
ORDER BY `created_at` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `history`
---
    public function index()
    {
        $model = new HistoryModel();

        // pagination sederhana
        $perPage = (int) ($this->request->getGet('perPage') ?? 10);
        $page    = (int) ($this->request->getGet('page') ?? 1);

        $data = [
            'rows'      => $model->orderBy('created_at', 'DESC')->paginate($perPage, 'default', $page),
            'pager'     => $model->pager,
            'perPage'   => $perPage,
            'pageTitle' => 'Riwayat Klasifikasi',
        ];

SELECT *
FROM `history`
WHERE `history`.`id` = '4'
DELETE FROM `history`
WHERE `id` IN ('4')
---
    public function delete($id = null)
    {
        if (!$id) return $this->response->setStatusCode(400)->setJSON(['status' => 'error', 'message' => 'ID tidak valid', 'csrf' => csrf_hash()]);
        $model = new HistoryModel();
        if (!$model->find($id)) return $this->response->setStatusCode(404)->setJSON(['status' => 'error', 'message' => 'Data tidak ditemukan', 'csrf' => csrf_hash()]);
        try {
            $model->delete($id);